{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 100],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "batch_input_shape": [null, 100],
          "dtype": "float32",
          "units": 4096,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Reshape",
        "config": {
          "name": "reshape",
          "trainable": true,
          "dtype": "float32",
          "target_shape": [4, 4, 256]
        }
      },
      {
        "class_name": "UpSampling2D",
        "config": {
          "name": "up_sampling2d",
          "trainable": true,
          "dtype": "float32",
          "size": [2, 2],
          "data_format": "channels_last",
          "interpolation": "nearest"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.8,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        }
      },
      {
        "class_name": "UpSampling2D",
        "config": {
          "name": "up_sampling2d_1",
          "trainable": true,
          "dtype": "float32",
          "size": [2, 2],
          "data_format": "channels_last",
          "interpolation": "nearest"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.8,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        }
      },
      {
        "class_name": "UpSampling2D",
        "config": {
          "name": "up_sampling2d_2",
          "trainable": true,
          "dtype": "float32",
          "size": [2, 2],
          "data_format": "channels_last",
          "interpolation": "nearest"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.8,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        }
      },
      {
        "class_name": "UpSampling2D",
        "config": {
          "name": "up_sampling2d_3",
          "trainable": true,
          "dtype": "float32",
          "size": [3, 3],
          "data_format": "channels_last",
          "interpolation": "nearest"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.8,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_4",
          "trainable": true,
          "dtype": "float32",
          "filters": 3,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "dtype": "float32",
          "activation": "tanh"
        }
      }
    ]
  },
  "keras_version": "2.7.0",
  "backend": "tensorflow"
}
